Revit 2026 API

# ExporterIFCUtilsGetWallBaseOffset Method

---

Obtains the base offset of the wall.

**Namespace:** Autodesk.Revit.DB.IFC**Assembly:** RevitAPIIFC (in RevitAPIIFC.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public static double GetWallBaseOffset(
	Wall wall
)
```
```vb
Public Shared Function GetWallBaseOffset (
	wall As Wall
) As Double
```
```cpp
public:
static double GetWallBaseOffset(
	Wall^ wall
)
```
```fsharp
static member GetWallBaseOffset :
        wall : Wall -> float
```

#### Parameters

wall Wall
     The wall.

#### Return Value

Double The base offset of the wall.

| Exception | Condition |
| --- | --- |
| ArgumentNullException | A non-optional argument was null |

#### Reference

ExporterIFCUtils Class

Autodesk.Revit.DB.IFC Namespace